<?php

// 16, 図形の表示
//  0
//  00
//  000
// この図形をfor文を使って出力してください。

for($i = 0; $i <= 2; $i ++){
    for($j = 0; $j <= $i; $j ++){
        echo "0";
    };
    echo "\n";
};


// 17, 図形の表示
//    0
//   000
//  00000
// この図形をfor文を使って出力してください。

for($i = 0; $i < 3; $i++){
    for($j = 0; $j <2-$i; $j++){
        echo " ";
    };
    for($k = 0; $k <=$i*2; $k++){
        echo "0";
    };
    echo PHP_EOL;
};

// 18, 図形の表示
//    0
//   000
//  00000
//   000
//    0
// この図形をfor文を使って出力してください。

for($i = 0; $i < 3; $i++){
    for($j = 0; $j <2-$i; $j++){
        echo " ";
    }
    for($k = 0; $k <=$i*2; $k++){
        echo "0";
    }
    echo PHP_EOL;
}
for ($i = 0; $i < 2; $i++) {
    for ($j = 0; $j <$i+1; $j++) {
        echo " ";
    }
    for ($k = 0; $k < 3-$i*2; $k++) {
        echo "0";
    }
    echo "\n";
}


?>
