<?php

// 9. for文と条件式の組み合わせ3
// 20 ~ 50までの数字の中で2で割ったら奇数となる数字のみを出力してください
// for($i = 20 ;$i <= 50 ;$i++){
//   if($i % 2 === 0 && $i % 4 !== 0){
//     echo $i."\n";
//   }
// };
//↓訂正個所：if文の条件について
// for($i = 20;$i <= 50;$i ++){
    //     $num = $i / 2;
    //     if($num % 2 !==  0){
        //         echo $i."\n";
        //     }
        // };
//↓訂正個所(2回目）：if文の条件（小数点の出るものの排除）

for($i = 20 ;$i <= 50 ;$i++){
    $num = $i / 2;
    if(is_int($num)){
        if($num % 2 !== 0){
            
            echo $i."\n";
        };
    };
};

// 10. for文と条件式の組み合わせ4
// 20 ~ 50までの数字の中で2で割ったら奇数となる数字の個数を出力してください
// $count = 0;
// for($i = 20;$i <= 50;$i ++){
//   if($i % 2 === 0 && $i % 4 !== 0){
//     // echo $i."\n";
//     $count ++;
//   }
// };
// echo $count;
//↓訂正箇所：問９の内容を反映
// for($i = 20;$i <= 50;$i ++){
//     $num = $i / 2;
//     if($num % 2 !==  0){
//         $count ++;
//     }
// };
// echo $count;
//↓訂正箇所（２回目）：問９の内容を反映（小数点が出るものの排除）
$count = 0;

for($i = 20 ;$i <= 50 ;$i++){
    $num = $i / 2;
    if(is_int($num)){
        if($num % 2 !== 0){
            $count ++;
        };
    };
};

echo $count;

// 11. for文を使用した計算
// 1000未満の「3と7の倍数」は何個あるか　個数を出力してください

// $count = 0;
// for($i = 0;$i < 1000;$i ++){
//     if($i % 3 === 0 || $i % 7 === 0){
//         // echo $i."\n";
//         $count ++;
//     }
// };
// echo $count;

// 12. for文を使用した計算2
// 1000未満の「3と7の倍数」の5番目に大きい数を出力してください
// $count = 0;
// for($i = 0;$i < 1000;$i ++){
//   if($i % 3 === 0 || $i % 7 === 0 ){
//     $count ++;
//     if($count === 425){
//       echo $i;
//     };
//   };
// };
//↓訂正箇所：ループ処理の数え順、if文の条件

// $count = 0;
// for($i = 999;$i > 0;$i --){
//     if($i % 3 === 0 || $i % 7 === 0 ){
//         $count ++;
//         if($count === 5){
//             echo $i;
//         };
//     };
// };


?>